Repository: batrisyiasafri/salesvisualizer
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: id, ms, zh_hans

source: Sales Visualizer
id: Visualisasi Penjualan
ms: Pemvisual Jualan
zh_hans: 销售可视化工具

source: Turn boring CSVs into interactive charts and summaries instantly.
id: Ubah CSV membosankan menjadi grafik dan ringkasan interaktif secara instan.
ms: Tukar CSV membosankan kepada carta dan ringkasan interaktif serta-merta.
zh_hans: 瞬间将枯燥的 CSV 转换为互动图表和摘要。

source: Features
id: Fitur
ms: Ciri-ciri
zh_hans: 功能

source: Upload CSVs and generate clean sales reports
id: Unggah CSV dan buat laporan penjualan yang rapi
ms: Muat naik CSV dan hasilkan laporan jualan yang kemas
zh_hans: 上传 CSV 并生成清晰的销售报告

source: Interactive charts (bar, line, pie)
id: Grafik interaktif (batang, garis, pai)
ms: Carta interaktif (bar, garis, pai)
zh_hans: 交互式图表（柱状图、折线图、饼图）

source: Export to PDF and Excel
id: Ekspor ke PDF dan Excel
ms: Eksport ke PDF dan Excel
zh_hans: 导出为 PDF 和 Excel

source: Filter by date and item
id: Filter berdasarkan tanggal dan item
ms: Tapis mengikut tarikh dan item
zh_hans: 按日期和项目筛选

source: Try the Live Demo
id: Coba Demo Langsung
ms: Cuba Demo Langsung
zh_hans: 试用在线演示

source: Built with Python, Flask, Chart.js, and love.
id: Dibangun dengan Python, Flask, Chart.js, dan cinta.
ms: Dibina dengan Python, Flask, Chart.js, dan kasih sayang.
zh_hans: 基于 Python、Flask、Chart.js 以及满满的热情构建。

source: Terms of Use
id: Syarat Penggunaan
ms: Terma Penggunaan
zh_hans: 使用条款

source: {editor}: Editing failed
id: {editor}: Pengeditan gagal
zh_hans: {editor}：编辑失败

source: {editor}: Editing failed: {e}
id: {editor}: Pengeditan gagal: {e}
zh_hans: {editor}：编辑失败：{e}

source: Options
id: Opsi
zh_hans: 选项

source: Got unexpected extra argument ({args})
id: Mendapat argumen ekstra tak terduga ({args})
zh_hans: 收到意外的额外参数（{args}）

source: DeprecationWarning: The command {name!r} is deprecated.{extra_message}
id: Peringatan Depresiasi: Perintah {name!r} sudah tidak digunakan.{extra_message}
zh_hans: 弃用警告：命令 {name!r} 已被弃用。{extra_message}

source: Aborted!
id: Dibatalkan!
zh_hans: 已中止！

source: Commands
id: Perintah
zh_hans: 命令

source: Missing command.
id: Perintah hilang.
zh_hans: 缺少命令。

source: No such command {name!r}.
id: Tidak ada perintah {name!r}.
zh_hans: 没有此命令 {name!r}。

source: Value must be an iterable.
id: Nilai harus dapat diiterasi.
zh_hans: 值必须是可迭代对象。

source: Takes {nargs} values but 1 was given.
id: Memerlukan {nargs} nilai tapi 1 diberikan.
zh_hans: 需要 {nargs} 个值，但只给了 1 个。

source: DeprecationWarning: The {param_type} {name!r} is deprecated.{extra_message}
id: Peringatan Depresiasi: {param_type} {name!r} sudah tidak digunakan.{extra_message}
zh_hans: 弃用警告：{param_type} {name!r} 已被弃用。{extra_message}

source: env var: {var}
id: variabel lingkungan: {var}
zh_hans: 环境变量：{var}

source: default: {default}
zh_hans: 默认值：{default}

source: required
id: diperlukan
zh_hans: 必需

source: (dynamic)
id: (dinamis)
zh_hans: （动态）

source: %(prog)s, version %(version)s
id: %(prog)s, versi %(version)s
zh_hans: %(prog)s，版本 %(version)s

source: Show the version and exit.
id: Tampilkan versi dan keluar.
zh_hans: 显示版本并退出。

source: Show this message and exit.
id: Tampilkan pesan ini dan keluar.
zh_hans: 显示此消息并退出。

source: Error: {message}
id: Kesalahan: {message}
zh_hans: 错误：{message}

source: Try '{command} {option}' for help.
id: Coba '{command} {option}' untuk bantuan.
zh_hans: 尝试使用 '{command} {option}' 获取帮助。

source: Invalid value: {message}
id: Nilai tidak valid: {message}
zh_hans: 无效的值：{message}

source: Invalid value for {param_hint}: {message}
id: Nilai tidak valid untuk {param_hint}: {message}
zh_hans: {param_hint} 的值无效：{message}

source: Missing argument
id: Argumen hilang
zh_hans: 缺少参数

source: Missing option
id: Opsi hilang
zh_hans: 缺少选项

source: Missing parameter
id: Parameter hilang
zh_hans: 缺少参数

source: Missing {param_type}
id: Hilangkan {param_type}
zh_hans: 缺少 {param_type}

source: Missing parameter: {param_name}
id: Parameter hilang: {param_name}
zh_hans: 缺少参数：{param_name}

source: No such option: {name}
id: Tidak ada opsi: {name}
zh_hans: 没有此选项：{name}

source: Did you mean {possibility}?
id: Apakah maksud Anda {possibility}?
zh_hans: 您是指 {possibility} 吗？

source: unknown error
id: kesalahan tidak diketahui
zh_hans: 未知错误

source: Could not open file {filename!r}: {message}
id: Tidak dapat membuka file {filename!r}: {message}
zh_hans: 无法打开文件 {filename!r}：{message}

source: Usage:
id: Penggunaan:
zh_hans: 用法：

source: Argument {name!r} takes {nargs} values.
id: Argumen {name!r} menerima {nargs} nilai.
zh_hans: 参数 {name!r} 需要 {nargs} 个值。

source: Option {name!r} does not take a value.
id: Opsi {name!r} tidak menerima nilai.
zh_hans: 选项 {name!r} 不接受值。

source: Option {name!r} requires an argument.
id: Opsi {name!r} memerlukan satu argumen.
zh_hans: 选项 {name!r} 需要一个参数。

source: Shell completion is not supported for Bash versions older than 4.4.
id: Penyelesaian shell tidak didukung untuk Bash versi sebelum 4.4.
zh_hans: Bash 4.4 以下版本不支持 Shell 补全。

source: Couldn't detect Bash version, shell completion is not supported.
id: Tidak dapat mendeteksi versi Bash, penyelesaian shell tidak didukung.
zh_hans: 无法检测 Bash 版本，Shell 补全不支持。

source: Repeat for confirmation
id: Ulangi untuk konfirmasi
zh_hans: 请重复确认

source: Error: The value you entered was invalid.
id: Kesalahan: Nilai yang Anda masukkan tidak valid.
zh_hans: 错误：您输入的值无效。

source: Error: {e.message}
id: Kesalahan: {e.message}
zh_hans: 错误：{e.message}

source: Error: The two entered values do not match.
id: Kesalahan: Dua nilai yang dimasukkan tidak cocok.
zh_hans: 错误：输入的两个值不匹配。

source: Error: invalid input
id: Kesalahan: input tidak valid
zh_hans: 错误：无效输入

source: Press any key to continue...
id: Tekan tombol apa saja untuk melanjutkan...
zh_hans: 按任意键继续...

source: Choose from: {choices}
id: Pilih dari: {choices}
zh_hans: 请选择： {choices}

source: {value!r} is not {choice}.
id: {value!r} bukan {choice}.
zh_hans: {value!r} 不是 {choice}。

source: {value!r} does not match the format {format}.
id: {value!r} tidak sesuai dengan format {format}.
zh_hans: {value!r} 不符合格式 {format}。

source: {value!r} is not a valid {number_type}.
zh_hans: {value!r} 不是有效的 {number_type}。

source: {value} is not in the range {range}.
zh_hans: {value} 不在范围 {range} 内。

source: {value!r} is not a valid boolean.
zh_hans: {value!r} 不是有效的布尔值。

source: {value!r} is not a valid UUID.
zh_hans: {value!r} 不是有效的 UUID。

source: file
zh_hans: 文件

source: directory
zh_hans: 目录

source: path
zh_hans: 路径

source: {name} {filename!r} does not exist.
zh_hans: {name} {filename!r} 不存在。

source: {len_type} values are required, but none were given.
zh_hans: {len_type} 个值是必需的，但未提供任何值。

source: invalid choice: {choice}. (choose from {choices})
zh_hans: 无效选择：{choice}。（可选项：{choices}）

source: invalid choice: {choice}.
zh_hans: 无效选择：{choice}。

source: invalid literal for int() with base {base}: {value!r}
zh_hans: 无效的整数字面量（基数 {base}）：{value!r}

source: invalid float value: {value!r}
zh_hans: 无效的浮点数值：{value!r}

source: invalid integer value: {value!r}
zh_hans: 无效的整数值：{value!r}

source: invalid boolean value: {value!r}
zh_hans: 无效的布尔值：{value!r}

source: invalid UUID value: {value!r}
zh_hans: 无效的 UUID 值：{value!r}

source: file does not exist: {filename!r}
zh_hans: 文件不存在：{filename!r}

source: directory does not exist: {filename!r}
zh_hans: 目录不存在：{filename!r}

source: path does not exist: {filename!r}
zh_hans: 路径不存在：{filename!r}

source: file is not readable: {filename!r}
zh_hans: 文件不可读：{filename!r}

source: file is not writable: {filename!r}
zh_hans: 文件不可写：{filename!r}

source: file is not executable: {filename!r}
zh_hans: 文件不可执行：{filename!r}

source: invalid file mode: {mode!r}
zh_hans: 无效的文件模式：{mode!r}

source: invalid encoding: {encoding!r}
zh_hans: 无效的编码：{encoding!r}

source: Value is not a valid email address.
zh_hans: 值不是有效的电子邮件地址。

source: Value is not a valid URL.
zh_hans: 值不是有效的 URL。

source: Value is not a valid IP address.
zh_hans: 值不是有效的 IP 地址。

source: Test Language Switching
id: Ujian Pertukaran Bahasa

source: Language:
ms: Bahasa:
